Revit 2026 API

# RebarContainerItemRebarShapeId Property

---

The RebarShape element that defines the shape of the rebar.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId RebarShapeId { get; set; }
```
```vb
Public Property RebarShapeId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ RebarShapeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member RebarShapeId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: shapeId is not the id of a RebarShape in the document. -or- When setting this property: A RebarContainerItem cannot be created from a Rebar Shape that has End Treatments or Cranks or terminations' rotation angles are different than 0. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

Changing the value of this property causes the Rebar instance to choose values for its shape parameters to preserve its previous shape as closely as possible

#### Reference

RebarContainerItem Class

Autodesk.Revit.DB.Structure Namespace